class Stabilizer
  def initialize()

  end
  # # Переводит рубли в доллары по введенному курсу
  # rub_to_usd = rub / exchange_usd
  #
  # # Считает сколько нужно продать долларов для уравновешивания корзины
  # buy_sell = (rub_to_usd + usd) / 2 - rub_to_usd
  #
  # # Определяет какая часть корзины больше
  # # Если средств в корзинах одинаковое количество, или докупить/продать надо меньше 1 цента
  # if buy_sell.abs <= 0.01
  #   puts 'Ваша корзина и без того уравновешена.'
  #
  # # Если рублей меньше, чем долларов - продать
  # elsif rub_to_usd < usd
  #   puts 'Вам нужно продать: $' + buy_sell.round(2).to_s
  #
  # # Если рублей больше, чем долларов - докупить
  # else
  #   puts 'Вам нужно докупить: $' + buy_sell.round(2).abs.to_s
  # end
end